# CustomScale Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseImportOptions..::..CustomScale Property
BaseImportOptions Class See Also
---
Scaling the import. If this is defined and a valid value (> 0.0), it takes priority over units.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double CustomScale { get; set; }
```

Visual Basic
---
```text
Public Property CustomScale As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double CustomScale {
	double get ();
	void set (double value);
}
```

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace